app/controllers/notes_controller.rb

INSERT INTO "notes" ("title", "note", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
def create
	@note = @book.notes.new(note_params)
	if @note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."book_id" = ? AND "notes"."id" = ? LIMIT 1  [["book_id", 26], ["id", 4]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 4]]
---
def destroy
	@note = @book.notes.find(params[:id])
    @note.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", nil]]
---
def set_book
	@book = Book.find(params[:book_id])