app/controllers/sessions_controller.rb

SELECT  "reviewers".* FROM "reviewers" WHERE "reviewers"."name" = ? LIMIT 1  [["name", ""]]
---
  def create
  	   reviewer = Reviewer.find_by(name: params[:reviewer][:name])